#include <iostream>

/* Описание задачи:
 1. Ввод размерности массива с клавиатуры во время выполнения программы,
    это обосновывает необходимость использования динамического тройного
 указателя (int***).
 2. Объединение указателей принципиально разных типов (на 3D-массив и символьную
 строку) в единый универсальный контейнер с помощью типа void*.
 3. Извлечение и вывод данных обратно через безопасное приведение типов
 (static_cast) с опорой на массив-идентификатор типов.
 4. Последовательное освобождение всей выделенной динамической памяти во
 избежание утечек.
 */

int main() {
  int x, y, z;
  std::cin >> x >> y >> z;

  int*** a = new int**[x];
  a[0] = new int*[y];
  a[0][0] = new int[z];

  a[0][0][0] = 10;
  a[0][0][1] = 20;

  char name[] = "Table";

  void* data[2] = {a, name};
  int type[2] = {0, 1};

  if (type[0] == 0) {
    int*** p = static_cast<int***>(data[0]);
    std::cout << p[0][0][0] << ", " << p[0][0][1] << '\n';
  }

  if (type[1] == 1) {
    std::cout << static_cast<char*>(data[1]) << '\n';
  }

  delete[] a[0][0];
  delete[] a[0];
  delete[] a;

  return 0;
}